app/Controllers/Producto.php

    public function index()
    {
        $productos = $this->productoModel->findAll();
---
SELECT *
FROM `productos`