app/Controllers/Usuario.php

    public function index(): string
    {
        $usuarios = $this->usuarioModel->findAll();
---
SELECT *
FROM `usuarios`

    public function store(): \CodeIgniter\HTTP\RedirectResponse
    {
        $usuario = [
            'nombre' => $this->request->getPost('nombre'),
            'apellido' => $this->request->getPost('apellido'),
            'telefono' => $this->request->getPost('telefono'),
            'contrasena' => $this->request->getPost('contrasena'),
            'correo' => $this->request->getPost('correo'),
            'estado' => $this->request->getPost('estado'),
            'ciudad' => $this->request->getPost('ciudad'),
            'direccion' => $this->request->getPost('direccion'),
        ];
        $this->usuarioModel->insert($usuario);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `telefono`, `contrasena`, `correo`, `estado`, `ciudad`, `direccion`) VALUES ('Jacqueline', 'Arredondo', '6221879531', 'Jacqueline1', 'jacqueline.arredondo@gmail.com', 'Sonora', 'Guaymas', 'Col. Independencia #31')

    public function edit($id): string
    {
        $usuario = $this->usuarioModel->find($id);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '2'

    public function update($id): \CodeIgniter\HTTP\RedirectResponse
    {
        $usuario = [
            'nombre' => $this->request->getPost('nombre'),
            'apellido' => $this->request->getPost('apellido'),
            'telefono' => $this->request->getPost('telefono'),
            'contrasena' => $this->request->getPost('contrasena'),
            'correo' => $this->request->getPost('correo'),
            'estado' => $this->request->getPost('estado'),
            'ciudad' => $this->request->getPost('ciudad'),
            'direccion' => $this->request->getPost('direccion'),
        ];
        $this->usuarioModel->update($id, $usuario);
---
UPDATE `usuarios` SET `nombre` = 'Andrea', `apellido` = 'Ortiz', `telefono` = '6221707624', `contrasena` = 'andrea1', `correo` = 'andrea.ortiz@gmail.com', `estado` = 'Sonora', `ciudad` = 'Hermosillo', `direccion` = 'Pesquera, #23, Col. Las granjas'
WHERE `usuarios`.`id` IN ('2')

    public function show($id): string
    {
        $usuario = $this->usuarioModel->find($id);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '3'